# -*- coding:utf-8 -*-
import sys
import requests
from elasticsearch import Elasticsearch
reload(sys)
sys.setdefaultencoding('utf-8')

params = {"match_all": {}}


es = Elasticsearch()
# # 创建索引
# es.indices.create(index='blend_news', ignore=400)
#
# # 索引一篇文档
# news_data = {
#     "title": "[腾讯行情]青岛 本田飞度优惠高达5000元",
#     "content": "现车销售，部分车型优惠可达5000元，感兴趣的朋友可以到店咨询购买。具体明细请参见下表：(注：购车时若说明是腾讯汽车网友，将能享受4S店提供的更多优惠)飞度指导价直降现价现车情况询价2018款1.5LMT舒适版7.38万0.50万↓6.88万现车充足询价2018款1.5LCVT舒适版8.18万0.50万↓7.68万现车充足询价2018款1.5LCVT舒适天窗版8.58万0.50万↓8.08万现车充足询价2018款1.5LCVT潮跑版8.88万0.50万↓8.38万现车充足询价2018款1.5LCVT潮跑+版9.38万0.50万↓8.88万现车充足询价2018款1.5LCVT豪华版10.28万0.50万↓9.78万现车充足询价促销时间：2018.03.27-2018.04.02制表腾讯汽车查看更多降价信息请进>>降价栏目首页参数配置|车型图片|车友点评|油耗飞度全国最低价：5.78万询问底价外观方面，新车的前进气格栅下方采用了半幅蜂窝状进气网样式，并在格栅周围增加了两条银色镀铬饰条进行点缀，前保险杠下方的进气口及雾灯区域造型也非常动感。内饰部分，新车依旧采用了家族式设计风格，仅在多媒体控制区按键上进行了小幅的调整。潮跑系列车型则将方向盘上的饰条改为亮黑色设计，并且方向盘、座椅及挡把等处加入了橙色缝线装饰。参数配置|车型图片|车友点评|油耗飞度全国最低价：5.78万询问底价动力方面，新款飞度将继续搭载现有的L15B型1.5L自然吸气发动机，最大输出功率131马力，峰值扭矩155牛米，传动系统匹配5速手动及CVT无级变速箱更多详情请咨询相关经销商经销商名称：青岛瑞驰汽车销售服务有限公司经销商地址：青岛市开发区江山中路118-1号各地行情：石家庄上海福州成都哈尔滨昆明广州太原南京东莞长春合肥沈阳大连宁波青岛深圳厦门济南重庆杭州郑州长沙查看更多>>南昌西安武汉佛山北京贵阳惠州台州江门金华兰州南宁温州宜昌湛江中山珠海湖州嘉兴绍兴襄阳阜阳济宁淄博临沂潍坊菏泽邯郸阳江泸州唐山秦皇岛保定孝感苏州无锡常州盐城镇江扬州南通邢台徐州衡水绵阳沧州十堰版权声明：本文系腾讯汽车独家稿件，版权为腾讯汽车所有。文章内的价格为编辑在车市第一线真实采集到的当日价格，由于汽车价格变化莫测，同时此价格只是个体经销商的行为，所以价格仅供参考使用。团购报名腾讯汽车爱车团报名流程报名参团电话确认团购活动完成购车注：腾讯爱车团活动规则最终解释权归腾讯汽车所有",
#     "url": "http://qingdao.auto.qq.com/a/20180327/010116.htm",
#     "keywords": "",
#     "pub_time": "2018-03-27",
#     "polarity": "1",
#     "category": "汽车",
#     "src": "腾讯"
# }
#
# print es.index(index='blend_news', doc_type='news_doc', body=news_data)


# 查询
# query_body = {
#   "query": {
#     "match": {
#       "title": "政府工作扶贫"
#     }
#   }
# }
#
# res = es.search(index='blend_news', doc_type='news_doc', body=query_body, params={"from": 30, "size": 10})
#
# print("Got %d Hits:" % res['hits']['total'])
# for hit in res['hits']['hits']:
#     print hit["_source"]['title']


# 删除全部数据
# delete_query = {
#   "query": {
#     "match_all": {}
#   }
#
# }
# print es.delete_by_query(index="blend_news", doc_type="news_doc", body=delete_query)
#



